# coding=utf8
# Created by Xinyu Zhu on 2022/2/2, 23:29

from collections import Counter

example = '''
长生殿外自在躲清闲　忽闻三生路魂灯不灭好奇是谁的真情感动上天　且等我　探一遭　这人间一声锣惊得我睁大双眼　茶楼酒肆铺满闹市长街桂花酒香便与人潮交叠　乌篷江岸佳人一曲传遍'食客翘首等一碗阳春面　墨客满腹才情廊下邀月公子执扇翩翩小姐掩面　苦于灯谜却留风情不解我曾一心向往天上的明月　怕今宵是庄生的蝴蝶梦碎了冷冷清清的宫阙　不免嫉妒人间　阴晴圆缺有人庙中求一线姻缘　有人为前程寒窗十年有红颜惊艳时光辜负岁月　到头来　一声叹　一生憾有人将权贵声望贪恋　有人在福中浑然不觉有英雄漂泊异乡故土遥远　同赏此月　夜不眠满城灯火映面丝竹不歇　一晃三更过半今夕何年今朝有酒今朝醉倒花间　何必苦苦追寻某种机缘谁家捣药的月兔顾影自怜　幻化成人红尘间留恋说书的将神话坊间传遍　殊不知逗笑了　哪路神仙有人庙中求一线姻缘　有人为前程寒窗十年有红颜惊艳时光辜负岁月　到头来　一声叹　一生憾有人将权贵声望贪恋　有人在福中浑然不觉有英雄漂泊异乡故土遥远　同赏此月夜不眠天上数日换作尘世百年一瞬清风擦面　何故撩拨我心弦凌霄宝殿怎及　阑珊处烟火点点长生殿外自在躲清闲　忽闻三生路魂灯不灭又是谁的真情感动了上天　不如我　再一探　这人间有情人尝过离合悲欢　有知己结伴江山览遍有好酒好歌供我玩乐消遣　共饮此杯　赏此月　夜好眠
'''


def get_pass(va1, va2):
    pass_num = va1 * 72 + va2 * (1015 + 1010) + 128

    print_pass(pass_num)


def print_pass(pass_num):
    print(pass_num)
    password = str(pass_num)
    key = "零壹贰叁肆伍陆柒捌玖拾佰仟"
    for i, p in enumerate(password):
        print(key[int(p)], end="")
        if i == 0:
            print("仟", end="")
        if i == 1:
            print("佰", end="")
        if i == 2:
            print("拾", end="")

        # if i == 0:
        #     print("阡", end="")
        # if i == 1:
        #     print("陌", end="")
        # if i == 2:
        #     print("拾", end="")
    print()

print(get_pass(10, 5))
c = Counter(example)
print(c)
# pass_num = 10*72+5*1015+1010+128
va1 = 16 / 10
va2 = 8
va1_range = [16]
va2_range = range(5, 9)
for va1 in va1_range:
    for va2 in va2_range:
        get_pass(va1, va2)
# if __name__ == '__main__':
#     for va1 in range(10, 20):


# print(10*72+5*1015+1010+128)

# “壹、贰、叁、肆、伍、陆、柒、捌、玖、拾、佰（陌）、仟（阡”
# #
# # 柒阡肆陌陆拾伍
# # 陆阡玖陌叁拾叁
# # 一、二、三、四、五、六、七、八、九、十、百、千”改为大写，用“壹、贰、叁、肆、伍、陆、柒、捌、玖、拾、佰（陌）、仟（阡
