# Created by Xinyu Zhu on 2022/7/29, 0:47
target = '''
齿下
齿上
辫_0_1
辫_1_1
辫_2_1
辫_3_1
辫_4_1
辫_5_1
辫_6_1
辫_7_1
辫_8_1
辫_9_1
辫_10_1
辫_11_1
辫_12_1
辫_13_1
辫_14_1
辫_15_1
辫_16_1
辫_17_1
辫_18_1
辫_19_1
辫_20_1
辫_21_1
辫_22_1
辫_23_1
右髮1_0_1
右髮1_1_1
右髮1_2_1
右髮1_3_1
右髮1_4_1
右髮1_5_1
右髮1_6_1
右髮1_7_1
右髮1_8_1
左髮_0_1
左髮_1_1
左髮_2_1
左髮_3_1
左髮_4_1
左髮_5_1
左髮_6_1
左髮_7_1
左髮_8_1
'''


dict = {
    "齿下": "teeth_d",
    "齿上": "teetch_u",
    "辫": "h",
    "右髮": "hair_r",
    "左髮": "hair_l"
}
if __name__ == '__main__':
    for key in dict:
        target = target.replace(key, dict[key])
    print(target)